tap "ariga/tap", trusted: true
tap "beeftornado/rmtree", trusted: true
tap "brona/iproute2mac", trusted: true
tap "buo/cask-upgrade", trusted: true
tap "delphinus/sfmono-square", trusted: true
tap "hashicorp/tap", trusted: true
tap "k1low/tap", "https://github.com/k1LoW/homebrew-tap", trusted: true
tap "neovim/neovim", trusted: true
tap "reviewdog/tap", trusted: true
tap "sonatype-nexus-community/nancy-tap", trusted: true
tap "teamookla/speedtest", trusted: true
tap "terraform-linters/tap", trusted: true
# Run your GitHub Actions locally
brew "act"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Text-based UI library
brew "ncurses"
# Library for command-line editing
brew "readline"
# General-purpose lossless data-compression library
brew "zlib"
# Generic library support script
brew "libtool"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Spell checker with better logic than ispell
brew "aspell"
# Freely available high-quality data compressor
brew "bzip2"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@78"
# Portable Foreign Function Interface library
brew "libffi"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Extraction utility for .zip compressed archives
brew "unzip"
# General-purpose data compression with high compression ratio
brew "xz"
# All in one CLI for all AsyncAPI tools
brew "asyncapi"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Highly capable, feature-rich programming language
brew "perl"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Terminal bandwidth utilization tool
brew "bandwhich"
# C library implementing the SSH2 protocol
brew "libssh2"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Garbage collector for C and C++
brew "bdw-gc"
# Greps through binaries from various OSs and architectures
brew "bingrep"
# Collection of portable C++ source libraries
brew "boost"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# C string library for manipulating Unicode strings
brew "libunistring"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Asynchronous event library
brew "libevent"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Next-gen compiler infrastructure
brew "llvm"
# C/C++/ObjC language server
brew "ccls"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Console Matrix
brew "cmatrix"
# Migemo is a tool that supports Japanese incremental search with Romaji
brew "cmigemo"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Library and utilities for processing GIFs
brew "giflib"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Graphics library to dynamically manipulate images
brew "gd"
# Common error values for all GnuPG components
brew "libgpg-error"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# Postgres C API library
brew "libpq"
# C XSLT library for GNOME
brew "libxslt"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Filename encoding conversion tool
brew "convmv"
# CLI tool for Amazon ECS and AWS Fargate
brew "copilot"
# High performance csv viewer for cli
brew "csview"
# Portable devkit for CI/CD pipelines
brew "dagger"
# POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew "dash-shell"
# Command-line DNS Client for Humans
brew "doggo"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# General purpose Language Server
brew "efm-langserver"
# C++ template library for linear algebra
brew "eigen"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Official Go implementation of the Ethereum protocol
brew "ethereum"
# More expressive universal gRPC client
brew "evans"
# Modern, maintained replacement for ls
brew "eza"
# ISO AAC audio encoder
brew "faac"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Standalone library of the Fraunhofer FDK AAC code from Android
brew "fdk-aac"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Ogg Bitstream Library
brew "libogg"
# Graphics Library
brew "mesa"
# Library to extract data from Excel .xls files
brew "freexl"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Command-line fuzzy finder written in Go
brew "fzf"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU awk utility
brew "gawk"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# Database of common MIME types
brew "shared-mime-info"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Geometry Engine
brew "geos"
# GitHub command-line tool
brew "gh"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Framework for layout and rendering of i18n text
brew "pango"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Remote repository management made easy
brew "ghq"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Render markdown on the CLI
brew "glow"
# Assuan IPC Library
brew "libassuan"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Fast linters runner for Go
brew "golangci-lint"
# Library access to GnuPG
brew "gpgme"
# Ping, but with a graph
brew "gping"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Command-line tool for generating regular expressions
brew "grex"
# Vulnerability scanner for container images and filesystems
brew "grype"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Fallback theme for FreeDesktop.org icon themes
brew "hicolor-icon-theme"
# GUI toolkit
brew "gtk+"
# Library for handling OpenGL function pointer management
brew "libepoxy"
# Keyboard configuration database for the X Window System
brew "xkeyboard-config"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Command-line hex viewer
brew "hexyl"
# Viewer/editor/analyzer for executables
brew "ht"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Verilog simulation and synthesis tool
brew "icarus-verilog"
# H.265/HEVC encoder
brew "x265"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser for C
brew "json-c"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Convert pixel information into colored ASCII art
brew "libcaca"
# Portable low-level networking library
brew "libdnet"
# Vorbis general audio compression codec
brew "libvorbis"
# Audio codec
brew "opus"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# VP8/VP9 video codec
brew "libvpx"
# LLVM Project Linker
brew "lld"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# CLI for Mermaid library
brew "mermaid-cli"
# Run a Kubernetes cluster locally
brew "minikube"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Open source relational database management system
brew "mysql-client"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Fish-like, POSIX-compatible shell
brew "nsh"
# Platform-neutral API for system-level and libc-like functions
brew "nspr"
# Libraries for security-enabled client and server applications
brew "nss"
# Development kit for the Java programming language
brew "openjdk"
# Vulnerability scanner which uses the OSV database
brew "osv-scanner"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Learn vim commands via a game
brew "pacvim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Modern Python package and dependency manager supporting the latest PEP standards
brew "pdm"
# Simplistic interactive filtering tool
brew "peco"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern replacement for ps written in Rust
brew "procs"
# Cartographic Projections Library
brew "proj"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Persistent key-value database, with built-in net interface
brew "redis"
# Provides fake name and address data
brew "rig"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Rust toolchain installer
brew "rustup"
# Intuitive find & replace CLI
brew "sd"
# SDL2 compatibility layer that uses SDL3 behind the scenes
brew "sdl2-compat"
# Blazing-fast modern Lua linter
brew "selene"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Compression/decompression library aiming for high speed
brew "snappy"
# Contract-oriented programming language
brew "solidity"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# SOund eXchange: universal sound sample translator
brew "sox"
# CLI utility for manipulating SQLite databases
brew "sqlite-utils"
# Cross-shell prompt for astronauts
brew "starship"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Version control system designed to be a better CVS
brew "subversion"
# SWF manipulation and generation tools
brew "swftools"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Rich and complete approach to parallelism in C++
brew "tbb"
# CI-Friendly tool to document a database
brew "tbls"
# Tool Command Language
brew "tcl-tk"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Open video compression format
brew "theora"
# Terminal multiplexer
brew "tmux"
# Minimal, todo.txt-focused editor
brew "todo-txt"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Program that allows you to count code, quickly
brew "tokei"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Source code spell checker
brew "typos-cli"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Use ViM as PAGER
brew "vimpager"
# Pager/text based browser
brew "w3m"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# High-performance, asynchronous messaging library
brew "zeromq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# A database toolkit
brew "ariga/tap/atlas", trusted: true
# Terraform
brew "hashicorp/tap/terraform", trusted: true
# mo is a Markdown viewer that opens .md files in a browser.
brew "k1low/tap/mo", trusted: true
# Automated code review tool integrated with any code analysis tools regardless of programming language.
brew "reviewdog/tap/reviewdog", trusted: true
# A tool to check for vulnerabilities in your Golang dependencies, powered by Sonatype Guide
brew "sonatype-nexus-community/nancy-tap/nancy", trusted: true
# Ookla Speedtest
brew "teamookla/speedtest/speedtest", trusted: true
vscode "arjun.swagger-viewer"
vscode "bierner.markdown-mermaid"
vscode "davidanson.vscode-markdownlint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "ics.japanese-proofreading"
vscode "meezilla.json"
vscode "mhutchie.git-graph"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.hexeditor"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "yzhang.markdown-all-in-one"
go "github.com/w40141/UsdmApi"
go "github.com/air-verse/air"
go "golang.org/x/tools/go/analysis/passes/defers/cmd/defers"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/go/analysis/passes/fieldalignment/cmd/fieldalignment"
go "golang.org/x/tools/go/analysis/passes/findcall/cmd/findcall"
go "github.com/ramya-rao-a/go-outline"
go "golang.org/x/tools/cmd/godoc"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/sanposhiho/gomockhandler"
go "github.com/fatih/gomodifytags"
go "github.com/uudashr/gopkgs/v2/cmd/gopkgs"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "golang.org/x/vuln/cmd/govulncheck"
go "golang.org/x/tools/cmd/guru"
go "github.com/gohugoio/hugo"
go "github.com/josharian/impl"
go "github.com/lestrrat-go/jwx/v2/cmd/jwx"
go "github.com/w40141/memo"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "github.com/golang/mock/mockgen"
go "golang.org/x/tools/go/analysis/passes/nilness/cmd/nilness"
go "github.com/oapi-codegen/oapi-codegen/v2/cmd/oapi-codegen"
go "github.com/stateful/runme"
go "github.com/k1LoW/runn/cmd/runn"
go "github.com/zoncoen/scenarigo/cmd/scenarigo"
go "golang.org/x/tools/go/analysis/passes/shadow/cmd/shadow"
go "github.com/volatiletech/sqlboiler/v4"
go "github.com/volatiletech/sqlboiler/v4/drivers/sqlboiler-mysql"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/rhysd/vim-startuptime"
winget "Audient.EVO"
winget "Canonical.Ubuntu"
winget "equalsraf.win32yank"
winget "Google.Chrome.EXE"
winget "Google.CloudSDK"
winget "Google.GoogleDrive"
winget "Microsoft.Office"
winget "Microsoft.PowerShell"
winget "Microsoft.Teams"
winget "Microsoft.Teams.Classic"
winget "Microsoft.VisualStudioCode"
winget "Microsoft.WindowsTerminal"
winget "Obsidian.Obsidian"
winget "SlackTechnologies.Slack"
winget "WiresharkFoundation.Wireshark"
winget "Zoom.Zoom.EXE"
npm "corepack"
npm "neovim"
