tap "argon/mas"
tap "beeftornado/rmtree"
tap "brona/iproute2mac"
tap "buo/cask-upgrade"
tap "delphinus/sfmono-square"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "k1low/tap"
tap "ktr0731/evans"
tap "michaeleisel/zld"
tap "mongodb/brew"
tap "neovim/neovim"
tap "noborus/tap"
tap "teamookla/speedtest"
tap "tgotwig/linux-dust"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Library and utilities for processing GIFs
brew "giflib"
# Library for manipulating PNG images
brew "libpng"
# General-purpose data compression with high compression ratio
brew "xz"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Spell checker with better logic than ispell
brew "aspell"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# GNOME accessibility toolkit
brew "atk"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Garbage collector for C and C++
brew "bdw-gc"
# Greps through binaries from various OSs and architectures
brew "bingrep"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Collection of portable C++ source libraries
brew "boost"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Freely available high-quality data compressor
brew "bzip2"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Manage compile and link flags for libraries
brew "pkg-config"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Asynchronous event library
brew "libevent"
# C string library for manipulating Unicode strings
brew "libunistring"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# GNU Emacs text editor
brew "emacs", restart_service: true
# Emacs dependency management
brew "cask"
# Command-line interface for SQLite
brew "sqlite"
# Next-gen compiler infrastructure
brew "llvm"
# C/C++/ObjC language server
brew "ccls"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Console Matrix
brew "cmatrix"
# Filename encoding conversion tool
brew "convmv"
# High performance csv viewer for cli
brew "csview"
# C library implementing the SSH2 protocol
brew "libssh2"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew "dash"
# Command-line DNS client
brew "dog"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# General purpose Language Server
brew "efm-langserver"
# C++ template library for linear algebra
brew "eigen"
# Official Go implementation of the Ethereum protocol
brew "ethereum"
# Modern replacement for 'ls'
brew "exa"
# ISO AAC audio encoder
brew "faac"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Standalone library of the Fraunhofer FDK AAC code from Android
brew "fdk-aac"
# Text-based UI library
brew "ncurses"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Ogg Bitstream Library
brew "libogg"
# Library to extract data from Excel .xls files
brew "freexl"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Command-line fuzzy finder written in Go
brew "fzf"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU awk utility
brew "gawk"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Geometry Engine
brew "geos"
# GitHub command-line tool
brew "gh"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Remote repository management made easy
brew "ghq"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Ping, but with a graph
brew "gping"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Command-line tool for generating regular expressions
brew "grex"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Fallback theme for FreeDesktop.org icon themes
brew "hicolor-icon-theme"
# GUI toolkit
brew "gtk+"
# Library for handling OpenGL function pointer management
brew "libepoxy"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# Command-line hex viewer
brew "hexyl"
# Command-line oriented TCP/IP packet assembler/analyzer
brew "hping"
# Viewer/editor/analyzer for executables
brew "ht"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Verilog simulation and synthesis tool
brew "icarus-verilog"
# Database of common MIME types
brew "shared-mime-info"
# H.265/HEVC encoder
brew "x265"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser for C
brew "json-c"
# Kubernetes command-line interface
brew "kubernetes-cli"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Convert pixel information into colored ASCII art
brew "libcaca"
# Portable low-level networking library
brew "libdnet"
# Portable Foreign Function Interface library
brew "libffi"
# Conversion library
brew "libiconv"
# Postgres C API library
brew "libpq"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Audio codec
brew "opus"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# VP8/VP9 video codec
brew "libvpx"
# C XSLT library for GNOME
brew "libxslt"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]
# Mac App Store command-line interface
brew "mas"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql-client"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Fish-like, POSIX-compatible shell
brew "nsh"
# Platform-neutral API for system-level and libc-like functions
brew "nspr"
# Libraries for security-enabled client and server applications
brew "nss"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Learn vim commands via a game
brew "pacvim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Perl compatible regular expressions library
brew "pcre"
# Simplistic interactive filtering tool
brew "peco"
# Highly capable, feature-rich programming language
brew "perl"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern replacement for ps written by Rust
brew "procs"
# Cartographic Projections Library
brew "proj"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Provides fake name and address data
brew "rig"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup-init"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Create beautiful image of your source code
brew "silicon"
# Compression/decompression library aiming for high speed
brew "snappy"
# Web-Scale Blockchain for decentralized apps and marketplaces
brew "solana"
# Contract-oriented programming language
brew "solidity"
# SOund eXchange: universal sound sample translator
brew "sox"
# CLI utility for manipulating SQLite databases
brew "sqlite-utils"
# Cross-shell prompt for astronauts
brew "starship"
# Version control system designed to be a better CVS
brew "subversion"
# SWF manipulation and generation tools
brew "swftools"
# Rich and complete approach to parallelism in C++
brew "tbb"
# Tool Command Language
brew "tcl-tk"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Open video compression format
brew "theora"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Program that allows you to count code, quickly
brew "tokei"
# Anonymizing overlay network for TCP
brew "tor", restart_service: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extraction utility for .zip compressed archives
brew "unzip"
# Vi 'workalike' with many additional features
brew "vim"
# Use ViM as PAGER
brew "vimpager"
# Pager/text based browser
brew "w3m"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# Utility to configure and test X input devices
brew "xinput"
# Fast CSV toolkit written in Rust
brew "xsv"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# High-performance, asynchronous messaging library
brew "zeromq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# tbls is a CI-Friendly tool for document a database, written in Go.
brew "k1low/tap/tbls"
# Evans: more expressive universal gRPC client
brew "ktr0731/evans/evans"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Tools for executing SQL queries to CSV, LTSV and JSON
brew "noborus/tap/trdsql"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Web browser focusing on privacy
cask "brave-browser"
# GUI app for Homebrew
cask "cakebrew"
# Clipboard extension app
cask "clipy"
cask "color-oracle"
# API documentation browser and code snippet manager
cask "dash"
# Universal database tool and SQL client
cask "dbeaver-community"
# Trains AIs to understand and translate texts
cask "deepl"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Draw.io is free online diagram software
cask "drawio"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Build apps and clock faces for Fitbit
cask "fitbit-os-simulator"
cask "font-biz-udgothic"
# Universal design typeface in the Japanese Mincho type tradition
cask "font-biz-udmincho"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Japanese programming font which is a composed of Hack and GenJyuu-Gothic
cask "font-hackgen"
# Japanese programming font which is a composed of Hack and GenJyuu-Gothic
cask "font-hackgen-nerd"
cask "font-noto-sans-cjk"
# Font editor and converter for outline and bitmap fonts
cask "fontforge"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
cask "google-japanese-ime"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Screenshot and screen recording tool
cask "gyazo"
# Desktop automation application
cask "hammerspoon"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Interface for reading and syncing eBooks
cask "kindle"
# GPU-based terminal emulator
cask "kitty"
# Kubernetes IDE
cask "lens"
# Software for Logitech devices
cask "logi-options-plus"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# App to write, plan, collaborate, and get organized
cask "notion"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# Collaboration platform for API development
cask "postman"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# MySQL/MariaDB database management
cask "sequel-ace"
# PDF reader and note-taking application
cask "skim"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Development environment
cask "vagrant"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Network protocol analyzer
cask "wireshark"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Levelator", id: 1493326487
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Mathpix Snipping Tool", id: 1349670778
mas "NanoBrowser", id: 1440590513
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "TweetDeck", id: 485812721
mas "Xcode", id: 497799835
