tap "argon/mas"
tap "beeftornado/rmtree"
tap "brona/iproute2mac"
tap "buo/cask-upgrade"
tap "delphinus/sfmono-square"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "neovim/neovim"
tap "tgotwig/linux-dust"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Spell checker with better logic than ispell
brew "aspell"
# Portable Foreign Function Interface library
brew "libffi"
# Perl compatible regular expressions library
brew "pcre"
# Core application library for C
brew "glib"
# GNOME accessibility toolkit
brew "atk"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Garbage collector for C and C++
brew "bdw-gc"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Collection of portable C++ source libraries
brew "boost"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Next-gen compiler infrastructure
brew "llvm"
# C/C++/ObjC language server
brew "ccls"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# GNU multiple precision arithmetic library
brew "gmp"
# Generate code for scanning Z-polyhedra
brew "cloog"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Dependency Manager for PHP
brew "composer"
# Filename encoding conversion tool
brew "convmv"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew "dash"
# More intuitive version of du in rust
brew "dust"
# C++ template library for linear algebra
brew "eigen"
# Modern replacement for 'ls'
brew "exa"
# ISO AAC audio encoder
brew "faac"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Standalone library of the Fraunhofer FDK AAC code from Android
brew "fdk-aac"
# Ogg Bitstream Library
brew "libogg"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Library and utilities for processing GIFs
brew "giflib"
# C string library for manipulating Unicode strings
brew "libunistring"
# Manage compile and link flags for libraries
brew "pkg-config"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Audio codec
brew "opus"
# VP8/VP9 video codec
brew "libvpx"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Compression/decompression library aiming for high speed
brew "snappy"
# Open video compression format
brew "theora"
# H.265/HEVC encoder
brew "x265"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Library to extract data from Excel .xls files
brew "freexl"
# Command-line fuzzy finder written in Go
brew "fzf"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Geometry Engine
brew "geos"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Remote repository management made easy
brew "ghq"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Fallback theme for FreeDesktop.org icon themes
brew "hicolor-icon-theme"
# GUI toolkit
brew "gtk+"
# Library for handling OpenGL function pointer management
brew "libepoxy"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# Command-line hex viewer
brew "hexyl"
# Command-line oriented TCP/IP packet assembler/analyzer
brew "hping"
# Configurable static site generator
brew "hugo"
# Verilog simulation and synthesis tool
brew "icarus-verilog"
# USB multiplexor library for iOS devices
brew "libusbmuxd"
# Library to communicate with iOS devices natively
brew "libimobiledevice", args: ["HEAD"]
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# OpenEXR ILM Base libraries (high dynamic-range image file format)
brew "ilmbase"
# Database of common MIME types
brew "shared-mime-info"
# High dynamic-range image file format
brew "openexr"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser for C
brew "json-c"
# Audio and video processing tools
brew "libav"
# Convert pixel information into colored ASCII art
brew "libcaca"
# Portable low-level networking library
brew "libdnet"
# Cartographic Projections Library
brew "proj"
# Library and tools for dealing with GeoTIFF
brew "libgeotiff"
# Allows SpatiaLite to support ST_MakeValid() like PostGIS
brew "liblwgeom"
# Postgres C API library
brew "libpq"
# GNOME XML library
brew "libxml2"
# Adds spatial SQL capabilities to SQLite
brew "libspatialite"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# C XSLT library for GNOME
brew "libxslt"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Mac App Store command-line interface
brew "mas"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Open source relational database management system
brew "mysql"
# Text-based UI library
brew "ncurses"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Platform-neutral API for system-level and libc-like functions
brew "nspr"
# Libraries for security-enabled client and server applications
brew "nss"
# Development kit for the Java programming language
brew "openjdk"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Learn vim commands via a game
brew "pacvim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Simplistic interactive filtering tool
brew "peco"
# Highly capable, feature-rich programming language
brew "perl"
# Draw UML diagrams
brew "plantuml"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern replacement for ps written by Rust
brew "procs"
# Python 2 bindings for the Cairo graphics library
brew "py2cairo"
# Provides fake name and address data
brew "rig"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# SWF manipulation and generation tools
brew "swftools"
# Rich and complete approach to parallelism in C++
brew "tbb"
# Tool Command Language
brew "tcl-tk"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Anonymizing overlay network for TCP
brew "tor"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extraction utility for .zip compressed archives
brew "unzip"
# Vi 'workalike' with many additional features
brew "vim"
# Use ViM as PAGER
brew "vimpager"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Tracks most-used directories to make cd smarter
brew "z"
# High-performance, asynchronous messaging library
brew "zeromq"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
cask "0xed"
cask "alfred"
cask "android-studio"
cask "anki"
cask "atom"
cask "balenaetcher"
cask "boostnote"
cask "box-drive"
cask "cakebrew"
cask "clipy"
cask "color-oracle"
cask "dash"
cask "drawio"
cask "emacs"
cask "firefox"
cask "font-cica"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-inconsolata"
cask "font-input"
cask "font-migu-1m"
cask "font-myrica"
cask "font-noto-sans-cjk"
cask "font-noto-serif-cjk"
cask "font-source-han-code-jp"
cask "font-source-han-mono"
cask "font-source-han-sans"
cask "font-source-han-serif"
cask "fontforge"
cask "gog-galaxy"
cask "google-chrome"
cask "google-japanese-ime"
cask "google-photos-backup-and-sync"
cask "grammarly"
cask "iterm2"
cask "kindle"
cask "logitech-options"
cask "mactex-no-gui"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "notion"
cask "openinterminal"
cask "skim"
cask "skype"
cask "slack"
cask "sublime-text-dev"
cask "uhk-agent"
cask "vagrant"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "xquartz"
cask "zoomus"
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Levelator", id: 1493326487
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Mathpix Snipping Tool", id: 1349670778
mas "NanoBrowser", id: 1440590513
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "TweetDeck", id: 485812721
mas "Xcode", id: 497799835
