tap "argon/mas"
tap "brona/iproute2mac"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "neovim/neovim"
tap "rcmdnk/file"
cask "java"
brew "adns"
brew "aspell"
brew "libffi"
brew "pcre"
brew "glib"
brew "atk"
brew "autoconf"
brew "automake"
brew "bdw-gc"
brew "icu4c"
brew "boost"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "pixman"
brew "cairo"
brew "cheat"
brew "gmp"
brew "cloog"
brew "cmake"
brew "cmatrix"
brew "composer"
brew "convmv"
brew "ctags"
brew "curl"
brew "jemalloc"
brew "libevent"
brew "rtmpdump"
brew "eigen"
brew "faac"
brew "fdk-aac"
brew "libogg"
brew "fribidi"
brew "giflib"
brew "libtasn1"
brew "libunistring"
brew "nettle"
brew "p11-kit"
brew "gnutls"
brew "graphite2"
brew "harfbuzz"
brew "lame"
brew "little-cms2"
brew "openjpeg"
brew "webp"
brew "libvorbis"
brew "libvpx"
brew "opus"
brew "sdl2"
brew "snappy"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "ffmpeg"
brew "fish"
brew "libtool"
brew "pango"
brew "python@2"
brew "fontforge"
brew "freexl"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "gd"
brew "gdk-pixbuf"
brew "geos"
brew "ghostscript"
brew "ghq"
brew "git"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "go"
brew "pkg-config"
brew "gobject-introspection"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "hicolor-icon-theme"
brew "gtk+"
brew "libepoxy"
brew "gtk+3"
brew "py2cairo"
brew "pygobject"
brew "pygtk"
brew "gtk-mac-integration"
brew "hping"
brew "hugo"
brew "icarus-verilog"
brew "ilmbase"
brew "openexr"
brew "imagemagick"
brew "iproute2mac"
brew "oniguruma"
brew "jq"
brew "json-c"
brew "libav"
brew "libcaca"
brew "libdnet"
brew "proj"
brew "libgeotiff"
brew "libidn2"
brew "liblwgeom"
brew "libpq"
brew "libxml2"
brew "libspatialite"
brew "unibilium"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "llvm"
brew "llvm@5"
brew "lua@5.1"
brew "luajit"
brew "mackup"
brew "mas"
brew "msgpack"
brew "mysql"
brew "neovim"
brew "nkf"
brew "node"
brew "nodebrew"
brew "nspr"
brew "nss"
brew "nvm"
brew "ocaml"
brew "openssl@1.1"
brew "p7zip"
brew "pacvim"
brew "peco"
brew "perl"
brew "php"
brew "plantuml"
brew "poppler"
brew "rig"
brew "ruby"
brew "shared-mime-info"
brew "sphinx-doc"
brew "swftools"
brew "tbb"
brew "tcl-tk"
brew "tmux"
brew "toilet"
brew "tor"
brew "tree"
brew "vim"
brew "vimpager"
brew "w3m"
brew "wget"
brew "zeromq"
brew "zplug"
brew "zsh"
brew "zsh-completions"
brew "rcmdnk/file/brew-file"
cask "0xed"
cask "alfred"
cask "android-file-transfer"
cask "arduino"
cask "atom"
cask "box-drive"
cask "caffeine"
cask "cakebrew"
cask "clipy"
cask "console"
cask "cyberduck"
cask "drawio"
cask "dropbox"
cask "emacs"
cask "evernote"
cask "firefox"
cask "flux"
cask "font-dejavu-sans"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-input"
cask "font-iosevka-nerd-font"
cask "font-migu-1m"
cask "font-myrica"
cask "font-ricty-diminished"
cask "font-source-code-pro"
cask "font-source-han-code-jp"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-japanese-ime"
cask "gtkwave"
cask "iterm2"
cask "julia"
cask "kindle"
cask "mactex"
cask "macvim"
cask "mendeley"
cask "onedrive"
cask "skim"
cask "skype"
cask "slack"
cask "teamviewer"
cask "tor-browser"
cask "vagrant"
cask "virtualbox"
cask "vivaldi"
cask "wordpresscom"
cask "xampp"
cask "xquartz"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Mathpix Snipping Tool", id: 1349670778
mas "NanoBrowser", id: 1440590513
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "TweetDeck", id: 485812721
mas "Xcode", id: 497799835
