oh-my-fish/theme-agnoster
jethrokuan/z
jethrokuan/fzf
oh-my-fish/theme-bobthefish
oh-my-fish/plugin-expand
oh-my-fish/plugin-extract
oh-my-fish/plugin-peco
edc/bass
daenney/pyenv
ryoppippi/fish-poetry
