jorgebucaran/fisher
jethrokuan/z
oh-my-fish/plugin-extract
edc/bass
w40141/fish-my-pwm
w40141/fish-clitw
0rax/fish-bd
ryoppippi/fish-poetry
dracula/fish
PatrickF1/fzf.fish
decors/fish-ghq
wfxr/forgit
oh-my-fish/theme-bobthefish
