jorgebucaran/fisher
jethrokuan/fzf
jethrokuan/z
oh-my-fish/plugin-extract
oh-my-fish/theme-bobthefish
edc/bass
0rax/fish-bd
ryoppippi/fish-poetry
dracula/fish
decors/fish-ghq
wfxr/forgit
halostatue/fish-rust
