oh-my-fish/theme-agnoster
jethrokuan/z
jethrokuan/fzf
oh-my-fish/theme-bobthefish
oh-my-fish/plugin-expand
oh-my-fish/plugin-extract
oh-my-fish/plugin-peco
edc/bass
ryoppippi/fish-poetry
w40141/fish-my-pwm
w40141/fish-clitw
0rax/fish-bd
decors/fish-ghq
