oh-my-fish/plugin-extract
oh-my-fish/theme-bobthefish
fisherman/gitignore
fisherman/z
fisherman/fzf
oh-my-fish/plugin-balias
oh-my-fish/plugin-expand
oh-my-fish/plugin-peco
fisherman/spin
edc/bass
0rax/fish-bd
tsu-nera/fish-peco_recentd
yoshiori/fish-peco_select_ghq_repository
